// ============================================================================================ //
// 題名:                                                                                      
// 概要:                                                                                      
//                                                                                              
// 作成日 XX/XX/XXXX Author: Hashimoto Yuto AT12E-275-29
// 追記:                                                                                        
// MM/DD/YYYY Author: ○○                                                                      
// ・××の変更～～～～                                                                         
// ===============================================================================================

#ifndef CUBE_DEBUG_H
#define CUBE_DEBUG_H
#pragma once

// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
// 
// インクルードファイル
// 
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

#include <d3dx9.h>


// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
//
// マクロ定義
//
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

#define FVF_CUBE_DEBUG_VERTEX3D (D3DFVF_XYZ | D3DFVF_DIFFUSE )
#define CUBE_DEBUG_PRIMITIVE_TYPE ( D3DPT_LINELIST )	//プリミティブタイプ
#define CUBE_DEBUG_PRIMITIVE_NUM	( 12 )					//ポリゴン数

// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
//
// 構造体 | クラス
//
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

typedef struct Cube_Debug_Vertex_tag{
public:
	D3DXVECTOR3 Pos;
	D3DCOLOR	Color;
}Cube_Debug_Vertex;


static Cube_Debug_Vertex CubeDebug[] =
{
	// x軸平行
	{ { -0.5f,	 0.5f,	-0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ { 0.5f,	 0.5f,	-0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ { -0.5f,   0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,   0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ { -0.5f,  -0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,  -0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ { -0.5f,  -0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,  -0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	// y軸平行											
	{ { -0.5f,	 0.5f,	-0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ { -0.5f,	-0.5f,	-0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ {  0.5f,   0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,  -0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ {  0.5f,   0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,  -0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ { -0.5f,   0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ { -0.5f,  -0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	// z軸平行											
	{ { -0.5f,	-0.5f,	-0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ { -0.5f,	-0.5f,	 0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ {  0.5f,  -0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {  0.5f,  -0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ {   0.5f,  0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ {   0.5f,  0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },

	{ { -0.5f,  0.5f,  -0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) },
	{ { -0.5f,  0.5f,   0.5f }, D3DCOLOR_RGBA( 0, 0, 0, 255 ) }
};
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
// 
// プロトタイプ宣言
// 
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

void Cube_Debug_Initialize();
void Cube_Debug_Update();
void Cube_Debug_Render();
void Cube_Debug_Finalize();





#endif // CUBE_DEBUG_H