//
//	CTimer.h
//		Author:YU NISHIMAKI 	DATE:2019/02/05
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef CTIMER_H
#define CTIMER_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include"Scene.h"
#include"ResultScene.h"

//Class

//================================================
//	マクロ定義	define
//================================================
#define LIMIT_TIME			(60)	// デフォルトの制限時間


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	クラス		class
//================================================


//-------------------------------------
//	Timerクラス
//-------------------------------------
class Timer
{
private:
	static int FrameCount;			// フレームカウンター
	static int LimitTime;			// 制限時間（フレーム単位）
	static int RemainTime;			// 残り時間（秒単位）
	static bool IsActive;			// タイマー進行中かどうか

public:
	static void Start();			// カウントスタート
	static void Stop();				// カウントストップ
	static void Reset();			// フレームカウントリセット
	static void Update(NSCENE::AScene* pNextScene);			// 更新
	static int GetTime();			// 残り時間取得
	static void AddTime( int second );
};


#endif