//
//	FbxModel.h
//		Author:	DATE:
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef FBXMODEL_H
#define FBXMODEL_H

//================================================
//	インクルード	include
//================================================
#include"common.h"

#include "stdafx.h"
#include <fbxsdk.h>
#include <d3dx9.h>

//================================================
//	マクロ定義	define
//================================================


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	名前空間 namespace
//================================================
namespace fbx
{
	int Initialize();	//初期化処理
	int Finalize();		//終了処理

	FbxScene* LoadScene(FbxManager* Manager, const char* Name, const char* FilePath);	//ロード
	FbxNode* GetNode(FbxScene* Scene);	//ノード取得
	int MeshNum(FbxScene* Scene);			//メッシュ数
	void LoadModel(FbxScene* Scene);

}
#endif