// ===============================================================================================
// プロジェクト名: 
// ファイル名: HewPlayer.h
// 概要: 池田さんがGameScene.cppに記述したCPlayerを移植した形.
// 作成日 02/09/2018 Author: Hashimoto Yuto AT12E-275-29                                       
// 追記:                                                                                        
// MM/DD/YYYY Author: ○○                                                                      
// ・××の変更～～～～                                                                         
// ===============================================================================================

#ifndef _HEW_PLAYER_H_
#define _HEW_PLAYER_H_
#pragma once

// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
// 
// インクルードファイル
// 
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

//
// Windows系
// 

// 
// 自作系
//
#include "CCamera.h"
#include "CGameObject.h"
#include "CGun.h"
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
// 
// 
// 
// -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

//===============================================
//	マクロ定義		define
//===============================================
#define SPEED_WALK (0.05f)
#define SPEED_RUN  (0.08f)

//===============================================
//	CPlayer
//===============================================
class CPlayer :public NRender3D::CGameObject
{
public:
	Camera Camera;
	CGun Gun;

public:
	float Aty;
	float Speed;
	bool bLean;		//[ true = 右 / false = 左 ]

public:
	CPlayer( CTransform* transform, AMesh* mesh );
	~CPlayer();

public:
	void Update();
	void Render();
};
/* +++++++++++++++ 注記<大> +++++++++++++++ */
/* ----- 注記<中> -----*/
// 注記<小>

#endif // _HEW_PLAYER_H_