//
//	ResultScene.h
//		Author:	DATE:
//===============================================
//	変更者 Changed By
//		Name:	DATE:
//
//-----------------------------------------------

#pragma once
#ifndef RESULTSCENE_H
#define RESULTSCENE_H

//================================================
//	インクルード	include
//================================================
#include"common.h"
#include"Scene.h"

//Class

//================================================
//	マクロ定義	define
//================================================


//================================================
//	列挙型		enum
//================================================


//================================================
//	構造体		struct/typedef
//================================================


//================================================
//	グローバル変数　global
//================================================


//================================================
//	クラス		class
//================================================

class ResultScene:public NSCENE::AScene
{
public:
	ResultScene() :AScene("Result") {};
public:
	void Initialize();
	void UpdateBegin();
	void Render();
	void UpdateEnd();
	void Finalize();
};

NSCENE::AScene* Get_ResultScene();

#endif